//#define _CRT_SECURE_NO_WARNINGS
#pragma warning(disable:4996)
#include <stdio.h>
#include "bit_utils.h"

/**
 * C语言中的运算符分为以下几种
 *
 * 1. 算术运算符
 * 2. 自增运算符，自减运算符
 * 3. 关系运算符
 * 4. 逻辑运算符
 * 5. 位运算符
 * 6. 逗号运算符
 * 7. 运算优先级
 */

/**
 * 自增运算符
 * i++ : 先用后+
 * ++i : 先加后用
 */
void increment_operator()
{
	// i++
	int i = 10;
    printf("i: %d\n", i++);

    // ++i
    i = 10;
    printf("i: %d\n", ++i);

    i = 10;
    int j = ++i; // 等同于  i = 1 + i; j = i;
    printf("j: %d\n", j);
    printf("-------------------------------------\n");
}

/**
 * 三目运算符
 */
void ternary_conditional_operator()
{
	int a, b, max;
	scanf("%d %d", &a, &b);
	max = a > b ? a : b;
	printf("max = %d\n", max);
	printf("-------------------------------------\n");
}

/* 
 * 加等运算符
 */
void add_equal_operator()
{
	int nums[] = { 1, 2, 3, 4, 5 };
	int len = sizeof(nums) / sizeof(nums[0]);
	int sum = 0 ;
	for (int i = 0; i < len; i++)
	{
		sum += nums[i];
	}
	printf("sum = %d\n", sum);
	printf("-------------------------------------\n");
}

/*
 * 乘等运算符
 */
void multiply_equal_operator()
{
	int nums[] = { 1, 2, 3, 4, 5 };
	int len = sizeof(nums) / sizeof(nums[0]);
	int sum = 1;
	for (int i = 0; i < len; i++)
	{
		sum *= nums[i];
	}
	printf("sum = %d\n", sum);
	printf("-------------------------------------\n");
}

/**
 * 取余运算符
 */
void mod_operator()
{
	int i;
	for (i = 0; i < 100; i++)
	{
		if (i % 10 == 0)
		{
			printf("\n");
		}
		printf("%4d", i);
	}

	for (i = 1; i <= 100; i++)
	{
		if (i % 10 == 1)
		{
			printf("\n");
		}
		printf("%4d", i);
	}
	printf("\n-------------------------------------\n");
}

/**
 * 位运算
 *
 * 1. 在进行位运算时，不足8位(一个字节)时需要左补0，如 8 => 1000 => 0000 1000
 * 2. 参加位运算的操作数必须是整型类型，以补码形式出现，计算结果自然也是补码
 * 3. 左移运算时正数可能会变负数，负数也可能会变正数，主要要看使用什么数据类型接收结果，因为不同的数据类型占据的空间宽度是不同
 *    的，如果是char类型数据byte7是符号位，如果是short类型，byte15是符号位，如果是int类型，byte31是符号位
 *
 * 	  正数10左移 一位到四位 全过程
 * 	  	             二进制数        char类型  short类型
 * 	  原始数据	0000 0000 0000 1010    10       10
 * 	  左移一位	0000 0000 0001 0100    20       20
 * 	  左移两位	0000 0000 0010 1000    40       40
 * 	  左移三位	0000 0000 0101 0000    80       80
 * 	  左移四位	0000 0000 1010 0000    -96	    160
 * 
 * 	  负数-10左移 一位到四位 全过程
 * 					 二进制数        char类型  short类型
 * 	  原始数据	1111 1111 1111 0110    -10      -10
 * 	  左移一位	1111 1111 1110 1100    -20      -20
 * 	  左移两位	1111 1111 1101 1000    -40      -40
 * 	  左移三位	1111 1111 1011 0000    -80      -80
 * 	  左移四位	1111 1111 0110 0000     96	  	-160
 *			
 * 	  -10左移四位 => 获取补码 => 获取反码 => 获取原码 => 获取十进制数
 *    -10 => 转换为二进制 => 1111 1111 1111 0110 => 左移四位(得到负数补码) => 1111 1111 0110 0000 => 补码-1得到反码 => 1111 1111 0101 1111
 * 					=> 符号位不变，其他位取反得到原码 => 1000 0000 1010 0000 => 使用short类型接收(byte15为符号位) => 1010 0000 * - 1 =>  -160
 */	
void bitwise_operator()
{
	/**
	 * a =  15	原码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 *  		反码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 *  		补码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 *
	 * b = -17	原码 => 1000 0000 0000 0000 0000 0000 0001 0001
	 * 			反码 => 1111 1111 1111 1111 1111 1111 1110 1110
	 * 			补码 => 1111 1111 1111 1111 1111 1111 1110 1111
	 *
	 * c =  10	原码 => 0000 0000 0000 0000 0000 0000 0000 1010
	 * 			反码 => 0000 0000 0000 0000 0000 0000 0000 1010
	 * 			补码 => 0000 0000 0000 0000 0000 0000 0000 1010
	 */
	int a = 15, b = -17, c = 10;
	printf("a = %d, b = %d\n", a, b);

	/**
	 * 一、与运算(& / AND)
	 * 1. 运算规则
	 * 	  - 全1则1，有0则0
	 *
	 * 2. 运算原理
	 *    - & 0：将二进制指定位 复位为 0
     *  		 1 & 0 => 0
	 *  		 0 & 0 => 0
	 *    - & 1：将二进制指定位 保留不变
     *  		 1 & 1 => 1
	 *  		 0 & 1 => 0
	 *
	 * 3. 操作方式
	 *    - 要复位为0的位二进制值为0，其他位二进制值为1
	 *
	 * 4. 运算示例
	 *      15 & -17
	 *      a =  15 补码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 * 														     &
	 *      a = -17 补码 => 1111 1111 1111 1111 1111 1111 1110 1111
	 * 														     =
	 * 	   	        补码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 * 	   	        反码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 * 	   	        原码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 * 	   	        结果 => 15
	 *
	 * 5. 应用场景
	 *    - 迅速清零 => a & 0
	 *      a =  15  补码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 * 														      &
	 * 		      0  补码 => 0000 0000 0000 0000 0000 0000 0000 0000
	 * 														      =
	 * 	    	     补码 => 0000 0000 0000 0000 0000 0000 0000 0000
	 * 	    	     反码 => 0000 0000 0000 0000 0000 0000 0000 0000
	 * 	    	     原码 => 0000 0000 0000 0000 0000 0000 0000 0000
	 *	  		     结果 => 0
	 *
	 *    - bit1复位为0 => a & 0xFFFFFFFD
	 *      a =  15  补码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 * 														      &
	 * 		      0  补码 => 1111 1111 1111 1111 1111 1111 1111 1101
	 * 														      =
	 * 	    	     补码 => 0000 0000 0000 0000 0000 0000 0000 1101
	 * 	    	     反码 => 0000 0000 0000 0000 0000 0000 0000 1101
	 * 	    	     原码 => 0000 0000 0000 0000 0000 0000 0000 1101
	 *	  		     结果 => 13
	 *
	 *    - 保留指定位 => a & 6，将二进制指定位 保留不变(这里保留bit1、bit2)
	 *      a =  15  补码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 * 														      &
	 *            6  补码 => 0000 0000 0000 0000 0000 0000 0000 0110
	 * 														      =
	 * 	    	     补码 => 0000 0000 0000 0000 0000 0000 0000 0110
	 * 	    	     反码 => 0000 0000 0000 0000 0000 0000 0000 0110
	 * 	    	     原码 => 0000 0000 0000 0000 0000 0000 0000 0110
	 *               结果 => 6
	 *
	 *    - 判断奇偶 => a & 1
	 *      a =  15  补码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 * 														      &
	 * 		      1  补码 => 0000 0000 0000 0000 0000 0000 0000 0001
	 * 														      =
	 * 	    	     补码 => 0000 0000 0000 0000 0000 0000 0000 0001
	 * 	    	     反码 => 0000 0000 0000 0000 0000 0000 0000 0001
	 * 	    	     原码 => 0000 0000 0000 0000 0000 0000 0000 0001
	 * 	    	     结果 => 1
	 */
	// 与运算运算示例
	printf("a & b = %d\n", a & b);
	// a = a & b; 可以简写为 a &= b;
	// 与运算应用场景
	printf("迅速清零 a & 0 = %d\n", a & 0);
	printf("bit1复位为0 a & 0xFFFFFFFD = %d\n", a & 0xFFFFFFFD);
	printf("保留指定 a & 6 = %d\n", a & 6);
	printf("判断奇偶 a & 1 = %d\n", a & 1);
	printf("判断奇偶 a & 1 = %s\n", a & 1 ? "奇" : "偶");

	/**
	 * 与运算练习1 - 判断 0-9 哪个是奇数，哪个是偶数
	 */
	for(int i = 0; i < 10; i++)
	{
		printf("判断奇偶 %d & 1 = %s\n", i, i & 1 ? "奇" : "偶");
	}

	/**
	 * 与运算练习2 - 判断 0-100 哪些数可以被8整除
	 *
	 * 原理 10 进制中个位为0可以被10整除，个位和百位都为0，可以被 10*10 = 100 整除，个位、百位和千位都为0，可以被 10*10*10 = 1000 整除
	 * 原理  2 进制中bit0为0可以被2整除，bit0和bit1都为0，可以被 2*2 = 4 整除，bit0、bit1和bit2都为0，可以被 2*2*2 = 8 整除
	 * 所以这里我们可以判断 bit0、bit1、bit2是否同时为0，使用与运算保留后 bit0、bit1、bit2 ，这里与 0111(0x07)
	 */
	for(int i = 0; i < 100; i++)
	{
		if((i & 0x07) == 0)
		{
			printf("能被8整除的数 %d\n", i);
		}
	}
	printf("---------\n");


	/**
	 * 二、或运算(| - OR)
	 * 1. 运算规则
	 * 	  - 有1则1，全0则0
	 *
	 * 2. 运算原理
	 *    - | 0：将二进制指定位 保留不变
	 *  		 1 | 0 => 1
	 *  		 0 | 0 => 0
	 *    - | 1：将二进制指定位 置位为 1
	 *  		 1 | 1 => 1
	 *  		 0 | 1 => 1
	 *
	 * 3. 操作方式
	 *    - 要置位为1的位二进制值为1，其他位二进制值为0
	 *
	 * 4. 运算示例
	 *      15 | -17
	 * 		a =  15	补码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 * 				   										     |
	 *      b = -17	补码 => 1111 1111 1111 1111 1111 1111 1110 1111
	 * 				   										     =
	 * 	  		    补码 => 1111 1111 1111 1111 1111 1111 1110 1111
	 * 	  		    反码 => 1000 0000 0000 0000 0000 0000 0001 0000
	 * 	  		    原码 => 1000 0000 0000 0000 0000 0000 0001 0001
	 * 	  		    结果 => -17
	 *
	 * 5. 应用场景
	 *    - bit2置位为1 => c | 4
	 *      c =  10  补码 => 0000 0000 0000 0000 0000 0000 0000 1010
	 * 														      |
	 *            4  补码 => 0000 0000 0000 0000 0000 0000 0000 0100
	 * 														      =
	 * 	    	     补码 => 0000 0000 0000 0000 0000 0000 0000 1110
	 * 	    	     反码 => 0000 0000 0000 0000 0000 0000 0000 1110
	 * 	    	     原码 => 0000 0000 0000 0000 0000 0000 0000 1110
	 *               结果 => 14
	 */
	// 或运算运算示例
	printf("a | b = %d\n", a | b);
	// 或运算应用场景
	printf("c | 4 = %d\n", c | 4);
	printf("---------\n");


	/**
	 * 三、非运算(~ - NOT)
	 * 1. 运算规则
	 * 	  - 1变为0，0变为1
	 *
	 * 2. 运算原理
	 *    - 将二进制指定位取反
	 *
	 * 3. 操作方式
	 *    - 二进制位按位取反
	 *
	 * 4. 运算示例
	 *      a =  15	补码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 * 			   										 	     ~
	 * 				   							         	     =
	 *    			补码 => 1111 1111 1111 1111 1111 1111 1111 0000
	 *    			反码 => 1000 0000 0000 0000 0000 0000 0000 1111
	 *    			原码 => 1000 0000 0000 0000 0000 0000 0001 0000
	 *    			结果 => -16
	 *
	 * 		b = -17	补码 => 1111 1111 1111 1111 1111 1111 1110 1111
	 * 			   										 	 	 ~
	 * 				   							         	 	 =
	 *    			补码 => 0000 0000 0000 0000 0000 0000 0001 0000
	 *    			反码 => 0000 0000 0000 0000 0000 0000 0001 0000
	 *    			原码 => 0000 0000 0000 0000 0000 0000 0001 0000
	 *    			结果 => 16
	 *
	 */
	printf("  ~ a = %d\n", ~a);
	printf("  ~ b = %d\n", ~b);


	/**
	 * 四、异或运算(^ - XOR)
	 * 1. 运算规则
	 * 	  - 相同为0，不同为1
	 *
	 * 2. 运算原理
	 *
	 * 3. 操作方式
	 *    - 要进行的两个二进制位，相同结果为0，不同为结果1
	 *
	 * 4. 运算示例
	 *    - a =  15	补码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 * 			   										 	     ^
	 *      b = -17	补码 => 1111 1111 1111 1111 1111 1111 1110 1111
	 * 				   							         	     =
	 *    			补码 => 1111 1111 1111 1111 1111 1111 1110 0000
	 *    			反码 => 1000 0000 0000 0000 0000 0000 0001 1111
	 *    			原码 => 1000 0000 0000 0000 0000 0000 0010 0000
	 *    			结果 => -32
	 *
	 * 5. 应用场景
	 *    - 高效判断两个整形操作数是否相等
	 *      int a = 10, b = 10;
	 *      if(a == b) {}
	 *      if(a - b == 0) {}
	 *      if((a ^ b) == 0) {}
	 *      if(!(a ^ b)) {}
	 *
	 *    - 不引入其他变量交换两个整形数据
	 *      a ^= b;
	 *      b ^= a;
	 *      a ^= b;
	 *
	 *    - 置位/复位操作(之前置位为1使用 | 操作完成，复位为 0 使用 & 操作完成，现在一个 ^ 就可以完成置位或复位操作)
	 *    	bit2置位为1 => c ^ 4
	 *      c =  10  补码 => 0000 0000 0000 0000 0000 0000 0000 1010
	 * 														      ^
	 *            4  补码 => 0000 0000 0000 0000 0000 0000 0000 0100
	 * 														      =
	 * 	    	     补码 => 0000 0000 0000 0000 0000 0000 0000 1110
	 * 	    	     反码 => 0000 0000 0000 0000 0000 0000 0000 1110
	 * 	    	     原码 => 0000 0000 0000 0000 0000 0000 0000 1110
	 *               结果 => 14
	 *
	 *    	bit1复位为0 => a ^ 2
	 *      a =  15  补码 => 0000 0000 0000 0000 0000 0000 0000 1111
	 * 														      ^
	 * 		      2  补码 => 0000 0000 0000 0000 0000 0000 0000 0010
	 * 														      =
	 * 	    	     补码 => 0000 0000 0000 0000 0000 0000 0000 1101
	 * 	    	     反码 => 0000 0000 0000 0000 0000 0000 0000 1101
	 * 	    	     原码 => 0000 0000 0000 0000 0000 0000 0000 1101
	 *	  		     结果 => 13
	 */
	printf("a ^ b = %d\n", a ^ b);
	// a = a ^ b; 可以简写为 a ^= b;
	printf("c ^ 4 = %d\n", c ^ 4);
	printf("a ^ 2 = %d\n", a ^ 2);
	printf("---------\n");


	/**
	 * 左移运算符 - << : 相当于在原来基础上扩大一倍
	 *
	 * a	8	0000 1000
	 * <<	<<	<<
	 * 1    1   1
	 * =	=	=
	 * 		16	0001 0000
	 */
	printf("%d << 1 = %d\n", a, a << 1);
	printf("-%d << 1 = %d\n", a, -a << 1);

	/**
	 * 右移运算符 - >> : 相当于在原来基础上缩小一倍
	 *
	 * a	8	0000 1000
	 * >>	>>	>>
	 * 1    1   1
	 * =	=	=
	 * 		4	0000 0100
	 */
	printf("%d >> 1 = %d\n", a, a >> 1);
	printf("-%d >> 1 = %d\n", a, -a >> 1);
	printf("-------------------------------------\n");
}

/**
 * 位运算和逻辑运算
 *   位运算不会短路，逻辑运算会短路
 */
void bitwise_operator_and_logic_operator()
{
	// 演示位运算不会短路
	int a = 10, b = 20;
	if(a > b & ++b)
	{

	}
	printf("位运算结果 b = %d\n", b);

	// 演示逻辑运算会短路
	a = 10, b = 20;
	if(a > b && ++b)
	{

	}
	printf("逻辑运算结果 b = %d\n", b);
	printf("-------------------------------------\n");
}

/**
 * 正数左移1到4位，当左移四位时分别使用 char 和 short 接收
 */
void positive_number_left_shift()
{
	char ch = 10;
	// 左移1位
	char r1 = ch << 1;
	printf("10 << 1 = %d\n", r1);

	// 左移2位
	char r2 = ch << 2;
	printf("10 << 2 = %d\n", r2);

	// 左移3位
	char r3 = ch << 3;
	printf("10 << 3 = %d\n", r3);

	// 左移4位
	char r4 = ch << 4;
	printf("10 << 4 = %d\n", r4);

	// 左移4位，注意：这里使用shor类型来接收了，而不是使用char类型来接收，即使左移4位，也不会越界的
	short r44 = ch << 4;
	printf("10 << 4 = %d\n", r44);
	printf("-------------------------------------\n");
}

/**
 * 负数左移1到4位，当左移四位时分别使用 char 和 short 接收
 */
void negative_number_left_shift()
{
	char ch = -10;
	
	// 左移1位
	char r1 = ch << 1;
	printf("-10 << 1 = %d\n", r1);
 
	// 左移2位
	char r2 = ch << 2;
	printf("-10 << 2 = %d\n", r2);
 
	// 左移3位
	char r3 = ch << 3;
	printf("-10 << 3 = %d\n", r3);
 
	// 左移4位
	char r4 = ch << 4;
	printf("-10 << 4 = %d\n", r4);
 
	// 左移4位，注意：这里使用shor类型来接收了，而不是使用char类型来接收，即使左移4位，也不会越界的
	short r44 = ch << 4;
	printf("-10 << 4 = %d\n", r44);
	printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 1. 判断奇偶(速度最快，比 n % 2 快得多)
 */
void bitwise_operator_case_01()
{
	int a = 8;
	// 特别注意：C语言种 == 优先级高于 &
	printf("a 是 %s\n", (a & 1) == 1 ? "奇数" : "偶数");
	printf("a 是 %s\n", a & 1 ? "奇数" : "偶数");
	printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 2. 乘 / 除 2 的幂(最快)
 */
void bitwise_operator_case_02()
{
	int a = 8, n = 2;
	printf("a << 1 = %d\n", a << 1);   // x * 2
	printf("a << n = %d\n", a << n);   // x * 2ⁿ
	printf("a >> 1 = %d\n", a >> 1);   // x / 2(向下取整)
	printf("a >> n = %d\n", a >> n);   // x / 2ⁿ(向下取整)
	printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 3. 交换两个整形数(不用临时变量)
 */
void bitwise_operator_case_03()
{
	int a = 10, b = 20;
	printf("a = %d, b = %d\n", a, b);
	a ^= b;
	b ^= a;
	a ^= b;
	printf("a = %d, b = %d\n", a, b);
	printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 4. 判断是不是 2 的幂
 */
void bitwise_operator_case_04()
{
	int a = 10;
	printf("a %s 2 的幂\n", (a & (a - 1)) == 0 ? "是" : "不是");
	printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 5. 统计二进制中 1 的个数(每消掉一个最右 1)
 *     公认的经典实现，效率最高
 */
void bitwise_operator_case_05()
{
	/**
	 * 公式
	 * 	  使用 a &= a - 1 可以把 a 的二进制里，最右边的一个 1 变成 0
	 * 原理
	 *	  对二进制借位减法原理的深入应用，二进制借位减法的原理，遇到第一个1，把1变0，右边全部变1，这样从第一个1的位置开始，上面的二
	 *	  进制是0，下面的二进制就是1，这样就把最右边的1消除了，当把所有的1消除完后，十进制的值就是0，在C语言中，0代表假，然后循环结束
	 *
	 * 	  int a   = 10 => 原码 0000 0000 0000 0000 0000 0000 0000 1010
	 * 	  			   => 反码 0000 0000 0000 0000 0000 0000 0000 1010
	 * 	  			   => 补码 0000 0000 0000 0000 0000 0000 0000 1010
	 *
	 *	  int a-1 =  9 => 原码 0000 0000 0000 0000 0000 0000 0000 1001
	 *	  			   => 反码 0000 0000 0000 0000 0000 0000 0000 1001
	 *	  			   => 补码 0000 0000 0000 0000 0000 0000 0000 1001
	 *
	 *	  a			   => 补码 0000 0000 0000 0000 0000 0000 0000 1010
	 *	  &															&
	 *	  a-1		   => 补码 0000 0000 0000 0000 0000 0000 0000 1001
	 *	  															=
	 *	  			   => 补码 0000 0000 0000 0000 0000 0000 0000 1000
	 *	  			   => 结果 把 a = 10 的最右边的1消除了
	 */
	int a = 10, c = 0;
	while(a)
	{
	    a &= a-1;
	    c++;
	}
	printf("统计二进制中 1 的个数 c = %d\n", c);
	printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 6. 统计二进制中 1 的个数(每次获取一个二进制数，然后相加)
 * 	  自己实现的，效率较低
 */
void bitwise_operator_case_06()
{
	int a = 10;
	int c = 0;
	while(a)
	{
		c += a & 0x01;
		a = a >> 1;
	}
	printf("统计二进制中 1 的个数 c = %d\n", c);
	printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 7. 统计二进制中 1 的个数(每次获取一个二进制数，然后相加)
 * 	  自己实现的，效率较低
 */
void bitwise_operator_case_07()
{
	int a = 10;
	int c = 0;
	while(a)
	{
		if(a & 0x01)
		{
			c++;
		}
		a = a >> 1;
	}
	printf("统计二进制中 1 的个数 c = %d\n", c);
	printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 8. 统计二进制中 1 的个数(每次获取一个二进制数，然后相加)
 * 	  自己实现的，效率还可以，每次操作四位，用空间换时间，避免了逐位统计 “1” 的循环，效率更高。
 */
void bitwise_operator_case_08()
{
	int a = 10;
	// 计算需要遍历的十六进制数的个数
    int n = sizeof(a) * 2;
    int c = 0;
    // 遍历每一个十六进制位
    for (int i = 0; i < n; ++i)
    {
    	// 查表累加当前位的“1”个数，ASCII格式的数字转换为整形类型，减去 '0' 即可
        c = c + "0112122312232334"[a & 0x0f] - '0';
        // 右移4位，处理下一个十六进制位
        a = a >> 4;
    }
    printf("统计二进制中 1 的个数 c = %d\n", c);
	printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 9. 统计二进制中 1 的个数(每次获取一个二进制数，然后相加)
 * 	  自己实现的，效率还可以，每次操作四位，用空间换时间，避免了逐位统计 “1” 的循环，效率更高。
 */
void bitwise_operator_case_09()
{
	int a = 10;
	// 计算需要遍历的十六进制数的个数
    int n = sizeof(a) * 2;
    int c = 0;
    // 遍历每一个十六进制位
    for (int i = 0; i < n; ++i)
    {
    	// 查表累加当前位的“1”个数，直接使用了转义字符，不用减去 '0' 了
        c = c + "\0\1\1\2\1\2\2\3\1\2\2\3\2\3\3\4"[a & 0x0f];
        // 右移4位，处理下一个十六进制位
        a = a >> 4;
    }
    printf("统计二进制中 1 的个数 c = %d\n", c);
	printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 10. 高低位交换 / 翻转(常用在加密 / 网络)
 */
void bitwise_operator_case_10()
{
	/**
	 * int a  = 10      => 原码 0000 0000 0000 0000 0000 0000 0000 1010
	 * 	  		        => 反码 0000 0000 0000 0000 0000 0000 0000 1010
	 * 	  		        => 补码 0000 0000 0000 0000 0000 0000 0000 1010
	 *
	 * a >> 4 = 10 >> 4 => 补码 0000 0000 0000 0000 0000 0000 0000 0000
	 * |    														 |
	 * a << 4 = 10 << 4 => 补码 0000 0000 0000 0000 0000 0000 1010 0000
	 * 													       	     =
	 * 					=> 补码 0000 0000 0000 0000 0000 0000 1010 0000
	 */
	int a = 10;
	// 简单示例：8位高低4位交换
	a = (a >> 4) | (a << 4);
	printf("a = %d\n", a);
	printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 11. 置位(把第bitn位置位为 1)
 */
void bitwise_operator_case_11()
{
	/**
	 * int a  = 1      => 原码 0000 0000 0000 0000 0000 0000 0000 0001
	 * 				   => 反码 0000 0000 0000 0000 0000 0000 0000 0001
	 * 				   => 补码 0000 0000 0000 0000 0000 0000 0000 0001
	 *
	 * a << n		   => 补码 0000 0000 0000 0000 0000 0000 0000 0100
	 *
	 * a			   => 补码 0000 0000 0000 0000 0000 0000 0000 0001
	 * |															|
	 * a << n          => 补码 0000 0000 0000 0000 0000 0000 0000 0100
	 * 																=
	 * 				   => 补码 0000 0000 0000 0000 0000 0000 0000 0101
	 * 				   => 反码 0000 0000 0000 0000 0000 0000 0000 0101
	 * 				   => 原码 0000 0000 0000 0000 0000 0000 0000 0101
	 * 				   => 结果 把 a = 1 的bit2置位为1了
	 */
	int a = 1, n = 2;
	// 置位 把第 n 位置位为 1，不影响其他位
	a |= (a << n);
	printf("a = %d\n", a);
	printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 12. 复位(把某一位设为 0)
 */
void bitwise_operator_case_12()
{
	/**
	 *  int a  = 5      => 原码 0000 0000 0000 0000 0000 0000 0000 0101
	 * 	 			    => 反码 0000 0000 0000 0000 0000 0000 0000 0101
	 * 				    => 补码 0000 0000 0000 0000 0000 0000 0000 0101
	 *
	 *  a << n		    => 补码 0000 0000 0000 0000 0000 0000 0001 0100
	 *
	 * ~(1 << n)		=> 补码 1111 1111 1111 1111 1111 1111 1000 1011
	 *
	 *  a			    => 补码 0000 0000 0000 0000 0000 0000 0000 0101
	 *  &															 &
	 * ~(1 << n)        => 补码 1111 1111 1111 1111 1111 1111 1000 1011
	 * 																 =
	 * 				    => 补码 0000 0000 0000 0000 0000 0000 0000 0001
	 * 				    => 反码 0000 0000 0000 0000 0000 0000 0000 0001
	 * 				    => 原码 0000 0000 0000 0000 0000 0000 0000 0001
	 * 				    => 结果 把 a = 5 的bit2置位为1了
	 */
	int a = 5, n = 2;
	// 复位 把第 n 位复位为 0，不影响其他位
	a &= ~(1 << n);
	printf("a = %d\n", a);
	printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 13. 翻转某一位(0 变 1，1 变 0)
 */
void bitwise_operator_case_13()
{
	int a = 1, n = 2;
	a ^= (1 << n);
	printf("a = %d\n", a);
	printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 14. 二进制形式打印int类型数据(n位长度版) - 方式一 每次打印完了后向左移动一位
 * 	  使用位运算打印二进制，这个思路极为的精巧，这个算法十分的优秀
 */
void bitwise_operator_case_14()
{
	int a = 10;
	int n = sizeof(a) * 8;
	// 从最高位到最低位
    for (int i = n-1; i >= 0; i--)
    {
        putchar((a >> i) & 1 ? '1' : '0');
    }
    printf("\n-------------------------------------\n");
}


/**
 * 位运算经典案例 15. 二进制形式打印int类型数据(n位长度版) - 方式二 每次打印完了后向右移动一位
 * 	  使用位运算打印二进制，这个思路极为的精巧，这个算法十分的优秀
 */
void bitwise_operator_case_15()
{
	int a = 10;
	int n = sizeof(a) * 8;
	// 从最高位到最低位
	for(int i = 0; i < n; i++)
	{
		int bit = (a & 0x80000000) ? 1 : 0;
		printf("%d", bit);
		a = a << 1;
	}
    printf("\n-------------------------------------\n");
}

/**
 * 位运算经典案例 16. 求绝对值
 */
void bitwise_operator_case_16()
{
	int n = -10;
    int mask = n >> 31;
    mask = (n + mask) ^ mask;
    printf("n 的绝对值 = %d\n", mask);
    printf("-------------------------------------\n");
}

/**
 * 位运算经典案例 17. 根据异或运算特性求出整型数组中不重复的数
 */
void bitwise_operator_case_17()
{
	int arr[] = { 1, 1, 2, 2, 3, 4, 4, 5, 5, };
	int j = 0;
	for(int i = 0; i < sizeof(arr)/sizeof(int); i++)
	{
		j ^= arr[i];
	}
	printf("数组中不重复的数是： %d\n", j);
	printf("-------------------------------------\n");
}

/**
 * 位运算工具类测试
 */
void bit_utils_test()
{
    uint8_t a = 0b10101100;
    printf("swap4: %02X\n", swap_4bits(a));
    printf("reverse8: %02X\n", reverse8(a));

    uint32_t state = 0;
    state = set_bit(state, 2);
    state = set_bit(state, 5);
    printf("bit2=%d, bit5=%d\n", get_bit(state,2), get_bit(state,5));
}

/**
 * 逗号运算符测试
 * 	  执行顺序 => 加不加括号都是从左到右依次计算
 */
void comma_operator()
{
	int a;
	a = (3, 5, 7);
	printf("a = %d\n", a);

	// 结果是3是因为逗号运算符的优先级低于等号
	int b;
	b = 3, 5, 7;
	printf("b = %d\n", b);

	/**
	 * x++ → x = 2
	 * y+3 → 5
	 */
	int x = 1;
	x = (x++, x+3);
	printf("x = %d\n", x);

	/**
	 * y++ → y = 2
	 * y+3 → 不算结果
	 * y*5 → 10
	 */
	int y = 1;
	y = (y++, y+3, y*5);
	printf("y = %d\n", y);
	printf("-------------------------------------\n");
}

int main()
{
	increment_operator();
//	ternary_conditional_operator();
	add_equal_operator();
	multiply_equal_operator();
	mod_operator();
	bitwise_operator();
	bitwise_operator_and_logic_operator();
	positive_number_left_shift();
	negative_number_left_shift();
	bitwise_operator_case_01();
	bitwise_operator_case_02();
	bitwise_operator_case_03();
	bitwise_operator_case_04();
	bitwise_operator_case_05();
	bitwise_operator_case_06();
	bitwise_operator_case_07();
	bitwise_operator_case_08();
	bitwise_operator_case_09();
	bitwise_operator_case_10();
	bitwise_operator_case_11();
	bitwise_operator_case_12();
	bitwise_operator_case_13();
	bitwise_operator_case_14();
	bitwise_operator_case_15();
	bitwise_operator_case_16();
	bitwise_operator_case_17();
	bit_utils_test();
	comma_operator();
}
