#include <stdio.h>
#include <string.h>
#include <math.h>

/**
 * 章节内容:
 *  1.2进制/8进制/16进制 -> 10进制
 *      2进制 -> 10进制
 *          1010 = 1*2^3 + 0*2^2 + 1*2^1 + 0*2^0
 *      8进制 -> 10进制
 *          1010 = 1*8^3 + 0*8^2 + 1*8^1 + 0*8^0
 *      16进制 -> 10进制
 *          1010 = 1*16^3 + 0*16^2 + 1*16^1 + 0*16^0
 *  2.10进制 -> 2进制/8进制/16进制(贪心算法转换)
 *
 *      十进制    103  103   39    7    7    7    3    1
 *              -----*-----*-----*-----*-----*-----*-----*-----*
 *                128    64    32    16     8     4     2     1
 *      差         -25    39     7    -8    -1     3     1     0
 *      二进制       0     1     1     0     0     1     1     1
 *      八进制       0     1  /  1     0     0  /  1     1     1  # 从右往左,每三位2进制就是一位8进制
 *                    1               4                  7
 *     十六进制      0     1     1     0  /  0     1     1     1
 *                           6                        7          # 从右往左,每四位2进制就是一位16进制
 *      103(10) = 1100111(2) = 0147(8) = 0x67(16)
 *
 */

/**
 * 将输入的十进制整数转换为对应的二进制表示并输出
 *
 * @param dec 待转换的十进制整数
 */
void dec_to_bin(int dec)
{
	// 存放二进制位的数组
	int binary[32];
	int i = 0;
	do
	{
		binary[i] = dec % 2;
		i++;
		dec /= 2;
	} while(dec > 0);

	// 获取整型数组真实长度
	int len = i;
	char binary_str[len+1];
	// 设置字符串以 '\0' 结尾
	binary_str[len] = '\0';
	for(i = 1; i <= len; i++)
	{
	    // 把整型数组转换成字符串
		sprintf(binary_str, "%s%d", binary_str, binary[len-i]);
	}
	printf("%s\n", binary_str);
}

/**
* 将输入的二进制字符串转换为对应的十进制整数
*
* @param binary_str 待转换的二进制字符串
* @return 返回转换后的十进制整数
*/
int bin_to_dec(char *binary_str)
{
	int len = strlen(binary_str);
    char binary_arr[len];
    strcpy(binary_arr, binary_str);

    int dec = 0;
	for(int i = 0; i < len; i++)
	{
		int r = (binary_arr[i] - '0') * (int)pow(2,len-i-1);
		dec += r;
	}
	return dec;
}

/**
* 十进制数转换成二进制数贪心算法版
* 使用贪心策略，从高位到低位依次确定每一位的值
* 通过比较当前数值与 2 的幂次大小来决定该位是 0 还是 1
*
* @param dec 待转换的十进制整数
*/
void dec_to_bin_greedy(int dec)
{
	int n = 0;
	do
	{
		n++;
	}while((2 << n) < dec);

	// 数组长度每4位一补齐，确保 (数组长度-1)%4 == 0
	int len = (n+2) % 4 == 0 ? n + 2 : 4 - (n+2) % 4 + n + 2;
	printf("len = %d\n", len);
	// 数组的长度 +1 是为了存放字符串的结束标识 '\0'
	char bin[len + 1];

	int i = 0;
	printf("n = %d\n",n);
	// 修正n的值，确保 (n+2) % 4 = 0,这样左边不足4位会补0
	n = (n+2) % 4 == 0 ? n : 4 - (n+2) % 4 + n;
	do
	{
		// 如果 n == -1，则将与 dec 比较的值设置为 1，否则将这个值设置为 2 << n
		if(dec >= (n == -1 ? 1 : 2 << n))
		{
			bin[i] = '1';
			dec = dec - (2 << n);
		}
		else
		{
			bin[i] = '0';
		}
		n--;
		i++;
	}while(n >= -1);
	// 设置字符串结尾为 '\0'
	bin[i] = '\0';
	printf("i = %d\n",i);
	printf("%s\n",bin);
}

/**
 * 将实数的小数转为二进制数(只处理小数部分，没有处理整数部分)： 乘二取整，顺序排列
 *
 * 示例 0.25
 *    0.25 * 2 = 0.5 取整数部分 0
 *    0.5  * 2 = 1.0 取整数部分 1
 * 结果 01
 *
 * 示例 0.2 (注意：这是无限循环小数，这里只打印前8位)
 * 	  0.2 * 2 = 0.4  取整数部分 0
 * 	  0.4 * 2 = 0.8  取整数部分 0
 * 	  0.8 * 2 = 1.6  取整数部分 1
 * 	  0.6 * 2 = 1.2  取整数部分 1
 * 	  0.2 * 2 = 0.4  取整数部分 0
 * 	  0.4 * 2 = 0.8  取整数部分 0
 * 	  0.8 * 2 = 1.6  取整数部分 1
 * 	  0.6 * 2 = 1.2  取整数部分 1
 * 结果 00110011
 *
 * @param f 待转换的浮点数小数部分（小于 1 的正数）
 */
void float_to_bin(float f)
{
	int c = 0;
	while(f < 1)
	{
		c++;
		f = f * 2;
		int i = f;
		printf("%d", i);
		if(f > 1)
		{
			f = f - 1;
		}
		if(c >= 8)
		{
			break;
		}
	}
}

int main()
{
    int i = 100;
    // %d：十进制整数
    printf("十进制表示 i = %d\n", i);
    // %o：八进制整数
    printf("八进制表示 i = %o\n", i);
	// %#o：显示前缀0的八进制整数
    printf("八进制表示(显示前缀0) i = %#o\n", i);
    // %x：十六进制整数
    printf("十六进制表示 i = %x\n", i);
    // %#x：显示前缀0x的十六进制整数
    printf("十六进制表示(显示前缀0x) i = %#x\n", i);
    // %#X：显示前缀0X的十六进制整数
    printf("十六进制表示(显示前缀0X) i = %#X\n", i);
    printf("-------------------------------------\n");


    int b = 0b10;
    printf("十进制表示 b = %d\n", b);
    int o = 010;
    printf("十进制表示 o = %d\n", o);
    int h = 0x10;
    printf("十六进制表示 o = %d\n", h);
    printf("-------------------------------------\n");


    printf("2进制1010  = 1*2^3 + 0*2^2 + 1*2^1 + 0*2^0 = 8 + 0 + 2 + 0 = 10\n");
    printf("8进制1010  = 1*8^3 + 0*8^2 + 1*8^1 + 0*8^0 = 512 + 0 + 8 + 0 = 520\n");
    printf("16进制1010 = 1*16^3 + 0*16^2 + 1*16^1 + 0*16^0 = 4096 + 0 + 16 + 0 = 4112\n");
    printf("-------------------------------------\n");


    int dec = 11;
    dec_to_bin(dec);

    char binary_str[] = "1010";
    dec = bin_to_dec(binary_str);
    printf("二进制数 %s 转换成十进制数是 %d \n", binary_str, dec);

    dec = 103;
    dec_to_bin_greedy(dec);

    // 实数的小数部分转换为二进制
    float f = 0.2;
    float_to_bin(f);
    return 0;
}
